# RemoveEmbeddedSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..RemoveEmbeddedSchedule Method
ScheduleDefinition Class See Also
---
Removes the embedded ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveEmbeddedSchedule()
```

Visual Basic
---
```text
Public Sub RemoveEmbeddedSchedule
```

Visual C++
---
```text
public:
void RemoveEmbeddedSchedule()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This ScheduleDefinition does not have an embedded ScheduleDefinition. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace